In [8]:
import pandas as pd
import numpy as np

loc = "fallcampdata/PivotData+(1).xlsx"
df = pd.read_excel(loc)

#### a) Percentage of students with a passing grade
#### b) Percentage of women with a passing grade
#### c) Average hours of study for all students
#### d) Average hours of study for students with a passing grade

In [9]:
df.head()

     Fname     Lname Gender Grade  Hours of Study
0     Mary  Ettienne      F     B              16
1  Charles    Looner      M     F               8
2    Betty  Franklin      F     A              24
3    Roger   Withers      M     C               5
4     John   Mulgrew      M     A               5

In [22]:
df['ispassing'] = np.where((df['Grade']!='F'),1,0)
df['woman'] = np.where((df['Gender']=='F'),1,0)

In [15]:
df.head()

     Fname     Lname Gender Grade  Hours of Study  ispassing
0     Mary  Ettienne      F     B              16          1
1  Charles    Looner      M     F               8          0
2    Betty  Franklin      F     A              24          1
3    Roger   Withers      M     C               5          1
4     John   Mulgrew      M     A               5          1

In [16]:
df.describe()

       Hours of Study   ispassing
count      999.000000  999.000000
mean        15.115115    0.916917
std          8.991187    0.276146
min          0.000000    0.000000
25%          7.000000    1.000000
50%         15.000000    1.000000
75%         23.000000    1.000000
max         30.000000    1.000000

In [20]:
pd.pivot_table(df, index='ispassing', values="Fname", aggfunc = 'count')

           Fname
ispassing
0             83
1            916

In [34]:
83/(916+83)

0.08308308308308308

In [37]:
pd.pivot_table(df, index='woman', values='ispassing')

       ispassing
woman
0       0.877339
1       0.953668

In [33]:
#pd.pivot_table(df, index="Fname", values='Hours of Study')

In [31]:
pd.pivot_table(df, index ='ispassing', values = 'Hours of Study')

           Hours of Study
ispassing
0                6.722892
1               15.875546